{
  "backend/main.mo": "Minimal Motoko canister with an empty actor definition.",
  "feature_evidence.json": "Feature evidence report linking implemented features to source files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining the romantic theme along with dark mode values.",
  "frontend/index.html": "HTML entry point that sets the Valentine-themed title and mounts the React app.",
  "frontend/src/App.tsx": "Main React app controlling unlock, proposal, and acceptance flows, including the evasive No button and tap sequence.",
  "frontend/src/components/AdminLinkNotice.tsx": "Small conditional warning component shown when an admin token exists in the URL hash.",
  "frontend/src/components/CopyShareLinkAction.tsx": "Button component that copies a sanitized share URL and briefly shows a confirmation state.",
  "frontend/src/components/PasswordGate.tsx": "Password gate flow that first shows a welcome screen, then a password prompt validating against a fixed code.",
  "frontend/src/components/RomanticSceneLayout.tsx": "Layout wrapper providing decorative backgrounds, floating hearts, and top-positioned admin and share-link controls.",
  "frontend/src/components/YesTapSequence.tsx": "A three‑step tap sequence component that cycles images and a final message with keyboard and click support.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminLinkNotice.ts": "Detects if the URL hash contains an admin token and updates on hash changes, returning a boolean.",
  "frontend/src/hooks/useEvasiveNoButton.ts": "Provides position and movement logic for an evasive button that jumps to random locations on hover or touch.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity auth client creation, login, logout, and state management.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables and romantic theme definitions for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentityProvider and mounts it to the DOM.",
  "frontend/src/utils/shareLink.ts": "Generates share URLs without hash fragments and offers a clipboard copy helper with fallback logic.",
  "frontend/tailwind.config.js": "Tailwind config extending colors, animations, utilities, and romantic theme bindings.",
  "project_state.json": "Describes the project’s current Valentine proposal web app state, including gated password flow, Yes/No interactions, and a looping multi-step post-Yes image sequence. Lists architectural notes, known issues, and existing features for planning updates."
}