{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence manifest listing removed share‑link UI, related cleanup, and affected frontend files/components.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of major frontend components, hooks, utilities, and layout behavior.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables, dark mode tokens, and base resets.",
  "frontend/index.html": "Root HTML entry defining the Valentine page and loading the main React bundle.",
  "frontend/src/App.tsx": "Main React app controlling password gate flow, proposal interaction, evasive No button, and success sequence.",
  "frontend/src/components/AdminLinkNotice.tsx": "Empty component file previously used for admin link notices.",
  "frontend/src/components/CopyShareLinkAction.tsx": "Empty component file formerly used for copying share links.",
  "frontend/src/components/PasswordGate.tsx": "Password gate UX with welcome screen, password prompt, validation, and unlock callback.",
  "frontend/src/components/RomanticSceneLayout.tsx": "Layout wrapper providing gradient backgrounds and animated floating hearts around nested content.",
  "frontend/src/components/YesTapSequence.tsx": "Three‑step tap-through sequence cycling images and a final love message with preloading and keyboard support.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdminLinkNotice.ts": "Empty hook placeholder with no implementation.",
  "frontend/src/hooks/useEvasiveNoButton.ts": "Provides position state and handlers to move the No button to random locations when hovered or touched.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context with auth-client login, logout, identity loading, and provider setup.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light/dark romantic themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/shareLink.ts": "Empty utility file with no implementation.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugin usage.",
  "project_state.json": "Tracks project metadata, requirements, issues, and architectural notes for the Valentine proposal app."
}