{
  "kind": "build_request",
  "title": "Add in-app share link that strips the caffeineAdminToken fragment",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Add an in-app “Copy Share Link” action that copies a clean URL for sharing by removing the “#caffeineAdminToken=…” fragment (and any other hash content) from the current page URL before copying.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "https://aqsuuu-meri-jaaan-ilvu-50c.caffeine.xyz/#caffeineAdminToken=ab6d750cdc80ef9ad843df3b6fdd933869db692441f4c6bcad554d95d8ea129d give me a shorter link to this",
          "I want you to make changes"
        ]
      },
      "acceptanceCriteria": [
        "When the app is opened with a URL containing a hash fragment like “#caffeineAdminToken=…”, the “Copy Share Link” action copies the same URL without any hash fragment (e.g., “https://…/”).",
        "The “Copy Share Link” action works on iPad Chrome (touch) and desktop browsers.",
        "After copying, the UI shows a brief confirmation message in English (e.g., “Link copied”).",
        "The copied link does not include the caffeineAdminToken value."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Surface the “Copy Share Link” action in a clearly accessible place on all main app screens (PasswordGate view, proposal view, and YesTapSequence view) without interfering with existing tap-to-advance interactions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I want you to make changes"
        ]
      },
      "acceptanceCriteria": [
        "A user can find and use “Copy Share Link” from the PasswordGate screen, the main proposal screen, and the YesTapSequence screen.",
        "The control does not block or capture taps intended for the YesTapSequence step-advance area (tapping the sequence content still advances as before).",
        "All user-facing labels for this control are in English and accessible (button has an aria-label that matches visible text)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "If the current URL contains “caffeineAdminToken” in the hash fragment, display a small non-blocking notice in English informing the user that the current link is an admin link and they should use “Copy Share Link” to share a safe link.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "https://aqsuuu-meri-jaaan-ilvu-50c.caffeine.xyz/#caffeineAdminToken=ab6d750cdc80ef9ad843df3b6fdd933869db692441f4c6bcad554d95d8ea129d"
        ]
      },
      "acceptanceCriteria": [
        "When “caffeineAdminToken” is present in the URL hash, a notice is shown on screen; when it is not present, the notice is not shown.",
        "The notice text is in English and does not reveal or display the token value.",
        "The notice does not prevent interaction with existing UI controls (password entry, Yes/No buttons, tap-through sequence)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not introduce any backend dependency for link generation/copying; this must be handled entirely in the frontend.",
    "Do not include or display the caffeineAdminToken value in any user-facing text or UI."
  ],
  "nonGoals": [
    "Do not integrate third-party URL shortener APIs or services inside the app.",
    "Do not change existing Valentine proposal content, password value, or the YesTapSequence step content/ordering unless explicitly requested later.",
    "Do not add authentication or any backend persistence."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}