{
  "kind": "build_request",
  "title": "Remove Copy Share Link UI from Version 12",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-30",
      "text": "Remove the in-app “Copy Share Link” control from all main app screens by eliminating its rendering from the shared layout so it no longer appears on the PasswordGate view, the Valentine proposal view, or the YesTapSequence success view.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "Remove this unnecessary copy share link from version 12"
        ]
      },
      "acceptanceCriteria": [
        "No button/control labeled \"Copy Share Link\" is visible anywhere in the app UI (PasswordGate, proposal screen, or YesTapSequence).",
        "There is no remaining interactive element whose accessible name/aria-label is \"Copy Share Link\"."
      ]
    },
    {
      "id": "REQ-31",
      "text": "Remove the admin-link warning notice that instructs users to use “Copy Share Link”, and ensure no user-facing text anywhere references “Copy Share Link”.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "Remove this unnecessary copy share link from version 12"
        ]
      },
      "acceptanceCriteria": [
        "When the URL contains a caffeineAdminToken hash fragment, no admin-link notice is displayed.",
        "No user-facing text in the app contains the phrase \"Copy Share Link\"."
      ]
    },
    {
      "id": "REQ-32",
      "text": "Clean up unused share-link code after removing the UI: ensure there are no remaining imports/references to CopyShareLinkAction, AdminLinkNotice, or the share-link utility functions that were only used for this feature, and the frontend builds without warnings/errors related to unused code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "Remove this unnecessary copy share link from version 12"
        ]
      },
      "acceptanceCriteria": [
        "`frontend` compiles successfully with no TypeScript errors introduced by removing the share-link feature.",
        "There are no remaining references/imports to the removed share-link UI components in the codebase."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only).",
    "Do not change the existing Valentine proposal flow, password gate behavior, evasive No button behavior, or the YesTapSequence looping interaction."
  ],
  "nonGoals": [
    "Do not add any new sharing features or alternative share buttons.",
    "Do not change the romantic theme styling, background, or animations except as required to remove the share-link/admin-notice UI.",
    "Do not modify backend canister logic (no backend changes needed)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}