{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove Copy Share Link UI and related notices (v12)",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Remove the in-app “Copy Share Link” control from all main screens by eliminating its rendering from the shared layout.",
      "acceptanceCriteria": [
        "No button/control labeled \"Copy Share Link\" is visible anywhere in the app UI (PasswordGate, proposal screen, or YesTapSequence).",
        "There is no remaining interactive element whose accessible name/aria-label is \"Copy Share Link\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RomanticSceneLayout.tsx",
          "operation": "modify",
          "description": "Remove rendering of the CopyShareLinkAction from the shared layout overlay so it no longer appears on PasswordGate, the proposal view, or the YesTapSequence success view; also remove the associated import and any now-unneeded wrapper markup for that control."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Remove the admin-link warning notice and any user-facing text that references “Copy Share Link”.",
      "acceptanceCriteria": [
        "When the URL contains a caffeineAdminToken hash fragment, no admin-link notice is displayed.",
        "No user-facing text in the app contains the phrase \"Copy Share Link\"."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RomanticSceneLayout.tsx",
          "operation": "modify",
          "description": "Stop rendering the AdminLinkNotice in the shared layout overlay so no notice appears even when the URL hash contains caffeineAdminToken."
        },
        {
          "path": "frontend/src/components/AdminLinkNotice.tsx",
          "operation": "delete",
          "description": "Remove the AdminLinkNotice component (it contains user-facing \"Copy Share Link\" text) so it cannot be rendered or referenced."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Clean up unused share-link code and remove remaining references/imports to the removed components/utilities; ensure frontend builds cleanly.",
      "acceptanceCriteria": [
        "`frontend` compiles successfully with no TypeScript errors introduced by removing the share-link feature.",
        "There are no remaining references/imports to the removed share-link UI components in the codebase."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CopyShareLinkAction.tsx",
          "operation": "delete",
          "description": "Remove the CopyShareLinkAction component entirely after it is no longer rendered anywhere."
        },
        {
          "path": "frontend/src/utils/shareLink.ts",
          "operation": "delete",
          "description": "Remove share-link utility functions that were only used by the removed CopyShareLinkAction."
        },
        {
          "path": "frontend/src/hooks/useAdminLinkNotice.ts",
          "operation": "delete",
          "description": "Remove the admin-token detection hook after AdminLinkNotice is removed to avoid unused code and ensure the frontend builds without unused-import/TS errors."
        },
        {
          "path": "frontend/src/components/RomanticSceneLayout.tsx",
          "operation": "modify",
          "description": "Ensure all imports/references to CopyShareLinkAction and AdminLinkNotice are removed so the file compiles cleanly after deletions."
        }
      ]
    }
  ]
}